{
    "ui": {
        "prep_time": "Preparation Time",
        "cook_time": "Cooking Time",
        "total_time": "Total Time",
        "servings": "Servings",
        "ingredients": "Ingredients",
        "steps": "Steps",
        "tags": "Tags",
        "category": "Category",
        "minutes": "minutes"
    },
    "recipes": {
        "green-apple-yogurt-salad": {
            "name": "Green Apple and Yogurt Salad",
            "description": "A vibrant and refreshing salad that delights your senses. The crisp tartness of green apple combines with cool cucumber and creamy yogurt for a harmonious, light combination. Perfect as an appetizer, side dish, or any-time meal. 🥗🍏",
            "ingredients": {
                "green-apple": "Green apples",
                "cucumber": "Cucumber",
                "natural-yogurt": "Natural yogurt",
                "lemon-juice": "Lemon juice",
                "honey": "Honey",
                "chopped-nuts": "Chopped walnuts",
                "raisins": "Raisins",
                "lettuce-leaves": "Lettuce leaves",
                "salt": "Salt",
                "pepper": "Pepper"
            },
            "steps": {
                "1": "Wash the apples and cucumber thoroughly. Peel the cucumber and slice it thinly. Cut the apples into cubes, leaving the peel on if preferred.",
                "2": "In a large bowl, mix the natural yogurt with lemon juice and honey. Stir well until fully combined.",
                "3": "Add the apples and cucumber to the yogurt mixture. Toss gently to coat.",
                "4": "Mix in the chopped walnuts and raisins, distributing them evenly.",
                "5": "Wash and dry the lettuce leaves. Arrange them on a serving platter.",
                "6": "Spoon the apple-cucumber salad over the lettuce. Season with salt and pepper to taste.",
                "7": "Refrigerate for at least 15 minutes before serving to let flavors meld."
            }
        },
        "chickpea-spinach-burgers": {
            "name": "Chickpea and Spinach Burgers",
            "description": "A delicious and healthy option, perfect for any occasion and easy to make. They're juicy, full of flavor, and easy to prepare, ideal for vegetarians and healthy food lovers. 🍔🌱",
            "ingredients": {
                "cooked-chickpeas": "Cooked Chickpeas",
                "spinach": "Spinach",
                "onion": "Onion",
                "garlic": "Garlic",
                "ground-cumin": "Ground cumin",
                "sweet-paprika": "Sweet paprika",
                "salt": "Salt",
                "pepper": "Pepper",
                "bread-crumbs": "Bread crumbs",
                "olive-oil": "Olive oil",
                "hamburger-buns": "Hamburger buns",
                "lettuce-leaves": "Lettuce leaves",
                "tomato-slices": "Tomato slices"
            },
            "steps": {
                "1": "Rinse and drain the cooked chickpeas and place them in a large bowl.",
                "2": "Add the chopped spinach, onion, and minced garlic to the bowl.",
                "3": "Mash the chickpeas and mix with the other ingredients until well combined.",
                "4": "Season with ground cumin, sweet paprika, salt, and pepper.",
                "5": "Add the bread crumbs, olive oil, and salt to the mixture and mix well until all ingredients are combined..",
                "6": "Form the mixture into 4 equal-sized patties.",
                "7": "Heat a pan over medium heat and cook the patties for 2-3 minutes on each side, or until golden brown.",
                "8": "Remove the burgers from the pan and place them on paper towels to remove excess oil.",
                "9": "Serve with lettuce leaves, tomato slices, and hamburger buns."
            }
        },
        
        "noIngredients": "No ingredients available",
        "noSteps": "No steps available",
        "noDescription": "No description available",
        "noName": "No name available",
        "noRecipe": "No recipe available"

    }
}
