{
    "ui": {
        "prep_time": "Tiempo de Preparaci贸n",
        "cook_time": "Tiempo de Cocci贸n",
        "total_time": "Tiempo Total",
        "servings": "Porciones",
        "ingredients": "Ingredientes",
        "steps": "Intrucciones",
        "tags": "Etiquetas",
        "category": "Categor铆a",
        "minutes": "minutos"
    },
    "recipes": {
        "green-apple-yogurt-salad": {
            "name": "Ensalada Verde de Manzana y Yogurtd",
            "description": "Una ensalada vibrante y refrescante que deleita tus sentidos. La acidez crujiente de la manzana verde se une a la frescura del pepino y la suavidad del yogur, creando una combinaci贸n armoniosa y ligera. Perfecta como entrada, acompa帽amiento o en cualquier momento. ",
            "ingredients": {
                "green-apple": "Manzanas verdes",
                "cucumber": "Pepino",
                "natural-yogurt": "Yogur natural",
                "lemon-juice": "Jugo de lim贸n",
                "honey": "Miel",
                "chopped-nuts": "Nueces picadas",
                "raisins": "Uvas pasas",
                "lettuce-leaves": "Hojas de lechuga",
                "salt": "Sal",
                "pepper": "Pimienta"
            },
            "steps": {
                "1": "Lava bien las manzanas y el pepino. Pela el pepino y c贸rtalo en rodajas finas. Corta las manzanas en cubos, dejando la c谩scara si lo prefieres.",
                "2": "En un taz贸n grande, mezcla el yogurt natural con el jugo de lim贸n y la miel. Revuelve bien hasta que todos los ingredientes est茅n bien integrados.",
                "3": "Agrega las manzanas y el pepino al taz贸n con la mezcla de yogurt. Remueve suavemente para que las frutas queden bien cubiertas con el aderezo.",
                "4": "A帽ade las nueces picadas y las pasas a la ensalada. Mezcla nuevamente para distribuir uniformemente los ingredientes.",
                "5": "Lava las hojas de lechuga y s茅calas bien. Coloca una cama de lechuga en un plato grande o en platos individuales.",
                "6": "Sirve la ensalada de manzana y pepino sobre la cama de lechuga. Espolvorea con sal y pimienta al gusto antes de servir.",
                "7": "Refrigera la ensalada durante al menos 15 minutos antes de servir para que los sabores se mezclen bien y la ensalada est茅 fresca."
            }
        },
        "chickpea-spinach-burgers": {
            "name": "Hamburguesas de Garbanzos y Espinacas",
            "description": "Una opci贸n deliciosa y saludable, perfectas para cualquier ocasi贸n y f谩ciles de hacer. Son jugosas, llenas de sabor y f谩ciles de preparar, ideales para vegetarianos y amantes de la comida saludable. ",
            "ingredients": {
                "cooked-chickpeas": "Garbanzos cocidos",
                "spinach": "Espinacas",
                "onion": "Cebolla",
                "garlic": "Ajo",
                "ground-cumin": "Comino molido",
                "sweet-paprika": "Piment贸n dulce",
                "salt": "Sal",
                "pepper": "Pimienta",
                "bread-crumbs": "Miga de pan",
                "olive-oil": "Aceite de oliva",
                "hamburger-buns": "Pan de hamburguesa",
                "lettuce-leaves": "Hojas de lechuga",
                "tomato-slices": "Rodajas de tomate"
            },
            "steps": {
                "1": "Enjuaga y escurre los garbanzos cocidos y col贸calos en un taz贸n grande..",
                "2": "A帽ade las espinacas picadas, la cebolla y el ajo picado al taz贸n.",
                "3": "Tritura los ingredientes con un tenedor o un machacador de papas hasta que est茅n bien combinados.",
                "4": "Incorpora el pan rallado, el comino en polvo, el piment贸n dulce, la sal y la pimienta a la mezcla y mezcla bien hasta que todos los ingredientes est茅n combinados..",
                "5": "Divide la mezcla en porciones y forma hamburguesas del tama帽o deseado.",
                "6": "Calienta una sart茅n a fuego medio y cocina las hamburguesas durante 2-3 minutos de cada lado, o hasta que est茅n doradas.",
                "7": "Retira las hamburguesas de la sart茅n y col贸calas sobre papel absorbente para eliminar el exceso de aceite.",
                "8": "Sirve con pan de hamburguesa, una cama de lechuga y rodajas de tomate."
            }
        },
        
        "noIngredients": "Ingredientes no disponibles",
        "noSteps": "Instrucciones no disponibles",
        "noDescription": "descripci贸n no disponible",
        "noName": "Nombre no disponible",
        "noRecipe": "Receta no disponible"

    }

}
