{
    "ui": {
        "prep_time": "Tiempo de Preparación",
        "cook_time": "Tiempo de Cocción",
        "total_time": "Tiempo Total",
        "servings": "Porciones",
        "ingredients": "Ingredientes",
        "steps": "Intrucciones",
        "tags": "Etiquetas",
        "category": "Categoría",
        "minutes": "minutos"
    },
    "recipes": {
        "green-apple-yogurt-salad": {
            "name": "Ensalada Verde de Manzana y Yogurtd",
            "description": "Una ensalada vibrante y refrescante que deleita tus sentidos. La acidez crujiente de la manzana verde se une a la frescura del pepino y la suavidad del yogur, creando una combinación armoniosa y ligera. Perfecta como entrada, acompañamiento o en cualquier momento. 🥗🍏",
            "ingredients": {
                "green-apple": "Manzanas verdes",
                "cucumber": "Pepino",
                "natural-yogurt": "Yogur natural",
                "lemon-juice": "Jugo de limón",
                "honey": "Miel",
                "chopped-nuts": "Nueces picadas",
                "raisins": "Uvas pasas",
                "lettuce-leaves": "Hojas de lechuga",
                "salt": "Sal",
                "pepper": "Pimienta"
            },
            "steps": {
                "1": "Lava bien las manzanas y el pepino. Pela el pepino y córtalo en rodajas finas. Corta las manzanas en cubos, dejando la cáscara si lo prefieres.",
                "2": "En un tazón grande, mezcla el yogurt natural con el jugo de limón y la miel. Revuelve bien hasta que todos los ingredientes estén bien integrados.",
                "3": "Agrega las manzanas y el pepino al tazón con la mezcla de yogurt. Remueve suavemente para que las frutas queden bien cubiertas con el aderezo.",
                "4": "Añade las nueces picadas y las pasas a la ensalada. Mezcla nuevamente para distribuir uniformemente los ingredientes.",
                "5": "Lava las hojas de lechuga y sécalas bien. Coloca una cama de lechuga en un plato grande o en platos individuales.",
                "6": "Sirve la ensalada de manzana y pepino sobre la cama de lechuga. Espolvorea con sal y pimienta al gusto antes de servir.",
                "7": "Refrigera la ensalada durante al menos 15 minutos antes de servir para que los sabores se mezclen bien y la ensalada esté fresca."
            }
        },
        "chickpea-spinach-burgers": {
            "name": "Hamburguesas de Garbanzos y Espinacas",
            "description": "Una opción deliciosa y saludable, perfectas para cualquier ocasión y fáciles de hacer. Son jugosas, llenas de sabor y fáciles de preparar, ideales para vegetarianos y amantes de la comida saludable. 🍔🌱",
            "ingredients": {
                "cooked-chickpeas": "Garbanzos cocidos",
                "spinach": "Espinacas",
                "onion": "Cebolla",
                "garlic": "Ajo",
                "ground-cumin": "Comino molido",
                "sweet-paprika": "Pimentón dulce",
                "salt": "Sal",
                "pepper": "Pimienta",
                "bread-crumbs": "Miga de pan",
                "olive-oil": "Aceite de oliva",
                "hamburger-buns": "Pan de hamburguesa",
                "lettuce-leaves": "Hojas de lechuga",
                "tomato-slices": "Rodajas de tomate"
            },
            "steps": {
                "1": "Enjuaga y escurre los garbanzos cocidos y colócalos en un tazón grande..",
                "2": "Añade las espinacas picadas, la cebolla y el ajo picado al tazón.",
                "3": "Tritura los ingredientes con un tenedor o un machacador de papas hasta que estén bien combinados.",
                "4": "Incorpora el pan rallado, el comino en polvo, el pimentón dulce, la sal y la pimienta a la mezcla y mezcla bien hasta que todos los ingredientes estén combinados..",
                "5": "Divide la mezcla en porciones y forma hamburguesas del tamaño deseado.",
                "6": "Calienta una sartén a fuego medio y cocina las hamburguesas durante 2-3 minutos de cada lado, o hasta que estén doradas.",
                "7": "Retira las hamburguesas de la sartén y colócalas sobre papel absorbente para eliminar el exceso de aceite.",
                "8": "Sirve con pan de hamburguesa, una cama de lechuga y rodajas de tomate."
            }
        },
        "chocolate-banana-smoothie": {
            "name": "Batido de Chocolate y Plátano",
            "description": "Un batido delicioso y nutritivo que combina el sabor del chocolate y la frescura del plátano. Perfecto para cualquier ocasió 🍌🥤",
            "ingredients": {
                "banana": "Banano",
                "cocoa-powder": "Cocoa en polvo",
                "milk": "Leche",
                "honey": "Miel",
                "ice-cubes": "Cubos de hielo"
            },
            "steps": {
                "1": "Corta el bananno en rodajas y llevalo a la licuadora.",
                "2": "Añade el resto de los ingredientes",
                "3": "Licúa hasta obtener una consistencia cremosa.",
                "4": "Sirve y disfruta!"
            }
        },
        "fresh-cucumber-jalapeño-salad": {
            "name": "Ensalada Fresca de Pepino y Jalapeños",
            "description": "Una ensalada vibrante y llena de sabor que combina la frescura crujiente del pepino con el toque audaz y picante de los jalapeños. Perfecta como acompañamiento para realzar cualquier plato o como una opción ligera y deliciosa por sí sola. 🌶️🥒",
            "ingredients": {
                "cucumber": "Pepino",
                "red-chile-jalapeno": "Chile Jalapeño rojo",
                "yellow-chile-jalapeno": "Chile Jalapeño amarillo",
                "purple-onion": "Cebolla morada",
                "lemon-juice": "Jugo de limón",
                "cilantro": "Cilantro fresco",
                "olive-oil": "Aceite de oliva",
                "salt": "Sal",
                "pepper": "Pimienta"
            },
            "steps": {
                "1": "En un tazón grande, combina los pepinos cortados, los chiles jalapeños rojo y amarillo, y la cebolla morada.",
                "2": "En un tazón pequeño, mezcla el jugo de limón, el aceite de oliva, la sal y la pimienta. Bate bien hasta que todos los ingredientes estén integrados.",
                "3": "Vierte la mezcla de aderezo sobre la ensalada y mezcla suavemente para que todos los ingredientes se impregnen del aderezo.",
                "4": "Si lo deseas, añade el cilantro fresco picado y mezcla nuevamente.",
                "5": "Deja reposar la ensalada en el refrigerador durante al menos 15 minutos antes de servquir para que los sabores se integren.",
                "6": "Sirve la ensalada fresca de pepino y jalapeños como acompañamiento o como plato principal ligero."
            }
        },
        "diary-free-pancakes": {
            "name": "Pancakes Esponjosos Sin Leche",
            "description": "La opción perfecta para el desayuno o merienda. Sin leche y con un toque irresistible de vainilla, se convierten en la base ideal para acompañar con miel, frutas frescas, o incluso un poco de chocolate derretido. 🥞🍓",
            "ingredients": {
                "all-purpose-flour": "Harina de trigo",
                "sugar": "Azúcar",
                "vanilla-extract": "Extracción de vainilla",
                "water": "Agua",
                "egg": "Huevo",
                "baking-powder": "Levadura en polvo",
                "butter": "Mantequilla",
                "salt": "Sal"
            },
            "steps": {
                "1": "En un tazón grande, mezcla la harina, el azúcar, el polvo de hornear y la pizca de sal.",
                "2": "En otro tazón, bate el huevo y añade el agua (o cualquier leche vegetal de tu elección) y la extracción de vainilla, mezclando bien.",
                "3": "Agrega la mezcla líquida a los ingredientes secos y mezcla hasta obtener una masa homogénea.",
                "4": "Calienta una sartén a fuego medio y engrásala con un poco de mantequilla.",
                "5": "Vierte un poco de la masa en la sartén caliente, formando tortitas del tamaño que desees.",
                "6": "Cocina las tortitas por ambos lados hasta que se hagan doradas, aproximadamente 2-3 minutos por lado.",
                "7": "Retira las tortitas de la sartén y repite el proceso con el resto de la masa.",
                "8": "Sirve las tortitas calientes con miel, frutas frescas o chocolate derretido.",
                "9": "¡Disfruta de tus pancakes esponjosos sin leche!"
            }
        },
        "tropical-coconut-punch": {
            "name": "Ponche Tropical de Coco",
            "description": "Una deliciosa y refrescante mezcla de coco fresco y especias aromáticas que evocan la brisa del mar y las vibras tropicales. Un deleite para tus sentidos que te hará sentir como si estuvieras en la playa! 🌴✨",
            "ingredients": {
                "coconut-milk": "Leche de coco",
                "condensed-milk": "Leche condensada",
                "whole-milk": "Leche entera",
                "sugar": "Azúcar",
                "white-rum": "Ron blanco",
                "vanilla-extract": "Extracto de vainilla",
                "cinnamon-power": "Canela en polvo",
                "nutmeg-powder": "Nuez moscada en polvo",
                "grated-coconut": "Coco rallado",
                "ice-cubes": "Cubos de hielo",
                "pineapple-slices": "Rodajas de piña",
                "cherries": "Cerezas"
            },
            "steps": {
                "1": "En una licuadora, combina la leche de coco, la leche condensada, la leche entera y el azúcar. Mezcla a alta velocidad hasta que todos los ingredientes estén bien integrados.",
                "2": "Agrega el ron blanco (si lo deseas), el extracto de vainilla, la canela en polvo y la nuez moscada. Mezcla nuevamente hasta que todo esté homogéneo.",
                "3": "Añade el coco rallado y mezcla a baja velocidad para que se integre sin deshacerse.",
                "4": "Si prefieres una textura más suave, puedes colar la mezcla para eliminar los grumos del coco rallado.",
                "5": "Refrigera la mezcla durante al menos 1 hora para que esté bien fría.",
                "6": "Para servir, llena un vaso con hielo y vierte el ponche de coco sobre el hielo..",
                "7": "Decora con rodajas de piña y cerezas en la parte superior antes de disfrutar.",
                "8": "¡Disfruta de tu ponche tropical de coco!"
            }
        },
        "baked-french-toast": {
            "name": "Tostadas Francesas al Horno",
            "description": "Disfruta de unas tostadas francesas crujientes y llenas de sabor. Esta receta es perfecta para quienes buscan una opción sin lactosa y sin freír, combinando la dulzura natural de las frutas con la textura crujiente del pan horneado. 🍓🥖",
            "ingredients": {
                "whole-wheat-bread": "Pan integral",
                "eggs": "Huevos",
                "almond-milk": "Leche de almendras",
                "maple-syrup": "Miel de maple",
                "bananas": "Bananos",
                "strawberries": "Fresas",
                "blueberries": "Arándanos",
                "spray-oil": "Aceite en spray",
                "salt": "Sal"
            },
            "steps": {
                "1": "Precalienta el horno a 180°C (350°F) y cubre una bandeja para hornear con papel pergamino o rocía con aceite en aerosol.",
                "2": "En un tazón grande, bate los huevos junto con la leche de almendra, el extracto de vainilla, la canela y una pizca de sal hasta que estén bien combinados.",
                "3": "Sumerge cada rebanada de pan integral en la mezcla de huevo, asegurándote de que ambos lados estén bien cubiertos.",
                "4": "Coloca las rebanadas de pan en la bandeja para hornear preparada.",
                "5": "Hornea las tostadas en el horno precalentado durante 15-20 minutos, volteándolas a la mitad del tiempo, hasta que estén doradas y cocidas por completo.",
                "6": "Mientras las tostadas se hornean, prepara las frutas. Corta el plátano y las fresas en rodajas y mezcla con los arándanos en un tazón.",
                "7": "Una vez que las tostadas estén listas, retíralas del horno y colócalas en platos individuales.",
                "8": "Cubre cada tostada con una porción generosa de la mezcla de frutas.",
                "9": "Rocía miel de maple sobre las tostadas y frutas antes de servir.",
                "10": "Sirve inmediatamente y disfruta de unas tostadas francesas saludables y llenas de sabor."
            }
        },
        "chicken-with-fresh-vegetables": {
            "name": "Pollo con Verduras Frescas",
            "description": "Un exquisito pollo marinado en escabeche, lleno de sabores vibrantes gracias a una mezcla de especias y vegetales frescos. Perfecto para compartir en  familia. Este platillo combina tradición y frescura en cada bocado, dejando a todos con ganas de repetir. 🍗🥕",
            "ingredients": {
                "chicken-pieces": "Presas de pollo (muslos o pechugas)",
                "tomatoes": "Tomates",
                "red-pepper": "Pimentón rojo",
                "rice": "Arroz",
                "onion": "Cebolla",
                "garlic": "Ajo",
                "panca-chiles": "Ajíes pancas",
                "welsh-onion": "Cebollín",
                "celery": "Apio",
                "vinegar": "Vinagre",
                "water": "Agua",
                "sugar": "Azúcar",
                "dried-oregano": "Orégano seco",
                "laurel": "Laurel",
                "salt": "Sal"
            },
            "steps": {
                "1": "En un tazón grande, mezcla el vinagre, el agua, el azúcar, el orégano, la hoja de laurel, sal y pimienta. Agrega las presas de pollo y deja marinar en el refrigerador durante al menos 2 horas, preferiblemente toda la noche.",
                "2": "En una olla grande, calienta un poco de aceite y sofríe la cebolla picada y el ajo hasta que estén dorados.",
                "3": "Agrega las presas de pollo marinadas (reserva la marinada) y dora por todos lados durante unos 5-7 minutos.",
                "4": "Incorpora los tomates, el pimiento, los ajíes pancas, la cebolla china y el apio. Cocina por unos 5 minutos, removiendo ocasionalmente.",
                "5": "Vierte la marinada reservada sobre el pollo y las verduras. Lleva a ebullición, luego reduce el fuego y cocina a fuego lento durante 30-40 minutos, o hasta que el pollo esté bien cocido y tierno.",
                "6": "Mientras se cocina el pollo, prepara el arroz. En una olla aparte, hierve 2 tazas de agua con un poco de sal. Agrega el arroz y cocina a fuego lento hasta que el agua se haya absorbido y el arroz esté tierno, aproximadamente 15-20 minutos.",
                "7": "Una vez que el pollo esté listo, retíralo del fuego y déjalo reposar durante unos minutos antes de servir.",
                "8": "Sirve el pollo al escabeche caliente, acompañado del arroz blanco.",
                "9": "Decora con cebollín picado y disfruta de este delicioso plato lleno de sabor."
            }
        },
        "colorful-stir-fried-vegetables": {
            "name": "Salteado Colorido de Verduras",
            "description": "Este salteado colorido de verduras es una mezcla vibrante y saludable que combina pimientos, cebolla, zanahoria y arvejas, todo salteado al dente y aderezado con un toque de limón. Perfecto como acompañamiento o plato principal ligero. 🥕🌶️🍋",
            "ingredients": {
                "green-peas": "Arvejas verdes",
                "carrots": "Zanahorias",
                "red-pepper": "Pimentón rojo",
                "yellow-pepper": "Pimentón",
                "onion": "Cebolla",
                "garlic": "Ajo",
                "parsley": "Perejil fresco",
                "lemon-juice": "Jugo de limón",
                "olive-oil": "Aceite de oliva",
                "salt": "Sal",
                "pepper": "Pimienta"
            },
            "steps": {
                "1": "Calienta el aceite de oliva en una sartén grande a fuego medio.",
                "2": "Agrega el ajo picado y sofríe durante 1 minuto hasta que esté fragante.",
                "3": "Incorpora la cebolla y cocina por 2-3 minutos hasta que esté transparente.",
                "4": "Añade los pimientos y las zanahorias, y saltea durante 5 minutos, removiendo ocasionalmente.",
                "5": "Agrega las arvejas y cocina por 2-3 minutos más, hasta que todas las verduras estén al dente.",
                "6": "Exprime el jugo de limón sobre las verduras y mezcla bien.",
                "7": "Sazona con sal y pimienta al gusto.",
                "8": "Retira del fuego y decora con perejil fresco picado antes de servir.",
                "9": "Disfruta de un plato saludable y colorido."
            }
        },
        "noIngredients": "Ingredientes no disponibles",
        "noSteps": "Instrucciones no disponibles",
        "noDescription": "descripción no disponible",
        "noName": "Nombre no disponible",
        "noRecipe": "Receta no disponible"
    }
}
